{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-INSURED",
    "2": "I-INSURED",
    "3": "B-COVERAGE",
    "4": "I-COVERAGE",
    "5": "B-PREMIUM",
    "6": "I-PREMIUM",
    "7": "B-POLICY_DATE",
    "8": "I-POLICY_DATE",
    "9": "B-EXCLUSION",
    "10": "I-EXCLUSION",
    "11": "B-POLICY_LIMIT",
    "12": "I-POLICY_LIMIT"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-COVERAGE": 3,
    "B-EXCLUSION": 9,
    "B-INSURED": 1,
    "B-POLICY_DATE": 7,
    "B-POLICY_LIMIT": 11,
    "B-PREMIUM": 5,
    "I-COVERAGE": 4,
    "I-EXCLUSION": 10,
    "I-INSURED": 2,
    "I-POLICY_DATE": 8,
    "I-POLICY_LIMIT": 12,
    "I-PREMIUM": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.5.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 30522
}
